#include <iostream>
#include <fstream>

// Домогацкий Иван ПС-22

// Среда выполнения:
// Apple clang version 16.0.0 (clang-1600.0.26.3)
// Target: arm64-apple-darwin24.6.0
// Thread model: posix

//  29. Имеется   телефонный   справочник   со   сведениями   о
// владельцах  телефонов.  Организовать  индексацию  по   номерам
// телефонов с помощью построения Б-дерева. Хранить дерево в виде
// самостоятельного  файла.  Обеспечить  дополнение,  удаление  и 
// корректировку  информации.  Проиллюстрировать   этапы   поиска
// информации по заданному номеру телефона (14).

int main(int argc, char *argv[])
{

}