// Домогацкий Иван ПС-22

// Среда выполнения:
// Apple clang version 16.0.0 (clang-1600.0.26.3)
// Target: arm64-apple-darwin24.6.0
// Thread model: posix

// 24. В  листьях  И-ИЛИ  дерева,  соответствующего некоторому
// множеству  конструкций,  заданы   значения   массы.   Известно
// максимально допустимое значение массы изделия. Требуется усечь
// дерево   так,   чтобы   дерево    включало    все    элементы,
// соответствующие  допустимым  значениям массы,  но не содержало
// "лишних" вершин.  Конечное дерево выдать на экран в  наглядном
// виде (12).

int main(int argc, char *argv[])
{
}